ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
        <register>
          <name>RXERR_P</name>
          <displayName>RXERR_P</displayName>
          <description>Peli RX Error Counter register</description>
          <alternateRegister>TXDR2_B</alternateRegister>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>RXERR</name>
              <description>RX error counter register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR3_B</name>
          <displayName>TXDR3_B</displayName>
          <description>Basic TX Data register 3</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR3</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXERR_P</name>
          <displayName>TXERR_P</displayName>
          <description>Peli TX Error Counter register</description>
          <alternateRegister>TXDR3_B</alternateRegister>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>TXERR</name>
              <description>TX error counter register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR4_B</name>
          <displayName>TXDR4_B</displayName>
          <description>Basic TX Data register 4</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR4</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SFF_P</name>
          <displayName>SFF_P</displayName>
          <description>Peli Send Frame Format register</description>
          <alternateRegister>TXDR4_B</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>FF</name>
              <description>Frame format</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTR</name>
              <description>Remote transmission request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLC</name>
              <description>Data length code bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_ACR0_P</name>
          <displayName>GROUP0_ACR0_P</displayName>
          <description>Peli Acceptance Code register 0</description>
          <alternateRegister>SFF_P</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR5_B</name>
          <displayName>TXDR5_B</displayName>
          <description>Basic TX Data register 5</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR5</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXID0_P</name>
          <displayName>TXID0_P</displayName>
          <description>Peli TX ID register 0</description>
          <alternateRegister>TXDR5_B</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>ID28</name>
              <description>Identifier bit 28</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID27</name>
              <description>Identifier bit 27</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID26</name>
              <description>Identifier bit 26</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID25</name>
              <description>Identifier bit 25</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID24</name>
              <description>Identifier bit 24</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID23</name>
              <description>Identifier bit 23</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID22</name>
              <description>Identifier bit 22</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID21</name>
              <description>Identifier bit 21</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_ACR1_P</name>
          <displayName>GROUP0_ACR1_P</displayName>
          <description>Peli Acceptance Code register 1</description>
          <alternateRegister>TXID0_P</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR6_B</name>
          <displayName>TXDR6_B</displayName>
          <description>Basic TX Data register 6</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR6</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXID1_P</name>
          <displayName>TXID1_P</displayName>
          <description>Peli TX ID register 1</description>
          <alternateRegister>TXDR6_B</alternateRegister>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>ID20</name>
              <description>Identifier bit 20</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID19</name>
              <description>Identifier bit 19</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID18</name>
              <description>Identifier bit 18</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID17</name>
              <description>Identifier bit 17</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID16</name>
              <description>Identifier bit 16</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID15</name>
              <description>Identifier bit 15</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID14</name>
              <description>Identifier bit 14</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID13</name>
              <description>Identifier bit 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_ACR2_P</name>
          <displayName>GROUP0_ACR2_P</displayName>
          <description>Peli Acceptance Code register 2</description>
          <alternateRegister>TXID1_P</alternateRegister>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR7_B</name>
          <displayName>TXDR7_B</displayName>
          <description>Basic TX Data register 7</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>TXDR7</name>
              <description>Transmit data register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA0_P</name>
          <displayName>TXDATA0_P</displayName>
          <description>Peli TX Data register 0</description>
          <alternateRegister>TXDR7_B</alternateRegister>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA0</name>
              <description>DATA0</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_ACR3_P</name>
          <displayName>GROUP0_ACR3_P</displayName>
          <description>Peli Acceptance Code register 3</description>
          <alternateRegister>TXDATA0_P</alternateRegister>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA1_P</name>
          <displayName>TXDATA1_P</displayName>
          <description>Peli TX Data register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA1</name>
              <description>DATA1</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_AMR0_P</name>
          <displayName>GROUP0_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>TXDATA1_P</alternateRegister>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA2_P</name>
          <displayName>TXDATA2_P</displayName>
          <description>Peli TX Data register 2</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA2</name>
              <description>DATA2</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_AMR1_P</name>
          <displayName>GROUP0_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <alternateRegister>TXDATA2_P</alternateRegister>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA3_P</name>
          <displayName>TXDATA3_P</displayName>
          <description>Peli TX Data register 3</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA3</name>
              <description>DATA3</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_AMR2_P</name>
          <displayName>GROUP0_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <alternateRegister>TXDATA3_P</alternateRegister>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA4_P</name>
          <displayName>TXDATA4_P</displayName>
          <description>Peli TX Data register 4</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA4</name>
              <description>DATA4</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP0_AMR3_P</name>
          <displayName>GROUP0_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <alternateRegister>TXDATA4_P</alternateRegister>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA5_P</name>
          <displayName>TXDATA5_P</displayName>
          <description>Peli TX Data register 5</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA5</name>
              <description>DATA5</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA6_P</name>
          <displayName>TXDATA6_P</displayName>
          <description>Peli TX Data register 6</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA6</name>
              <description>DATA6</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA7_P</name>
          <displayName>TXDATA7_P</displayName>
          <description>Peli TX Data register 7</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA7</name>
              <description>DATA7</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA8_P</name>
          <displayName>TXDATA8_P</displayName>
          <description>Peli TX Data register 8</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA8</name>
              <description>DATA8</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA9_P</name>
          <displayName>TXDATA9_P</displayName>
          <description>Peli TX Data register 9</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DATA9</name>
              <description>DATA9</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <displayName>CDR</displayName>
          <description>Clock Divider register</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <name>MODE</name>
              <description>CAN mode</description>
            </field>
          </fields>
        </register>
        <register>
          <name>AFM0</name>
          <displayName>AFM0</displayName>
          <description>Filter Mode register 0</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <name>AFM_7_1</name>
              <description>Acceptance filter mode</description>
            </field>
          </fields>
        </register>
        <register>
          <name>AFM1</name>
          <displayName>AFM1</displayName>
          <description>Filter Mode register 1</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AFM_15_8</name>
              <description>Acceptance filter mode</description>
            </field>
          </fields>
        </register>
        <register>
          <name>AFM2</name>
          <displayName>AFM2</displayName>
          <description>Filter Mode register 2</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <name>AFM_19_16</name>
              <description>Acceptance filter mode</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FGA0</name>
          <displayName>FGA0</displayName>
          <description>Filter Group Enable Register 0</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>FGA_7_0</name>
              <description>Filter group enable</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FGA1</name>
          <displayName>FGA1</displayName>
          <description>Filter Group Enable Register 1</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>FGA_15_8</name>
              <description>Filter group enable</description>
            </field>
          </fields>
        </register>
