ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
        <register>
          <name>GROUP4_AMR2_P</name>
          <displayName>GROUP4_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP4_AMR3_P</name>
          <displayName>GROUP4_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_ACR_B</name>
          <displayName>GROUP5_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_ACR0_P</name>
          <displayName>GROUP5_ACR0_P</displayName>
          <description>Peli Acceptance Code register0</description>
          <alternateRegister>GROUP5_ACR_B</alternateRegister>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_ACR1_P</name>
          <displayName>GROUP5_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_ACR2_P</name>
          <displayName>GROUP5_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_ACR3_P</name>
          <displayName>GROUP5_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_AMR_B</name>
          <displayName>GROUP5_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_AMR0_P</name>
          <displayName>GROUP5_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP5_AMR_B</alternateRegister>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_AMR1_P</name>
          <displayName>GROUP5_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_AMR2_P</name>
          <displayName>GROUP5_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP5_AMR3_P</name>
          <displayName>GROUP5_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_ACR_B</name>
          <displayName>GROUP6_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_ACR0_P</name>
          <displayName>GROUP6_ACR0_P</displayName>
          <description>Peli Acceptance Code register</description>
          <alternateRegister>GROUP6_ACR_B</alternateRegister>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_ACR1_P</name>
          <displayName>GROUP6_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_ACR2_P</name>
          <displayName>GROUP6_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_ACR3_P</name>
          <displayName>GROUP6_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_AMR_B</name>
          <displayName>GROUP6_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_AMR0_P</name>
          <displayName>GROUP6_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP6_AMR_B</alternateRegister>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_AMR1_P</name>
          <displayName>GROUP6_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_AMR2_P</name>
          <displayName>GROUP6_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP6_AMR3_P</name>
          <displayName>GROUP6_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_ACR_B</name>
          <displayName>GROUP7_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_ACR0_P</name>
          <displayName>GROUP7_ACR0_P</displayName>
          <description>Peli Acceptance Code register0</description>
          <alternateRegister>GROUP7_ACR_B</alternateRegister>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_ACR1_P</name>
          <displayName>GROUP7_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_ACR2_P</name>
          <displayName>GROUP7_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_ACR3_P</name>
          <displayName>GROUP7_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_AMR_B</name>
          <displayName>GROUP7_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_AMR0_P</name>
          <displayName>GROUP7_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP7_AMR_B</alternateRegister>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_AMR1_P</name>
          <displayName>GROUP7_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_AMR2_P</name>
          <displayName>GROUP7_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP7_AMR3_P</name>
          <displayName>GROUP7_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_ACR_B</name>
          <displayName>GROUP8_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_ACR0_P</name>
          <displayName>GROUP8_ACR0_P</displayName>
          <description>Peli Acceptance Code register</description>
          <alternateRegister>GROUP8_ACR_B</alternateRegister>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_ACR1_P</name>
          <displayName>GROUP8_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_ACR2_P</name>
          <displayName>GROUP8_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_ACR3_P</name>
          <displayName>GROUP8_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_AMR_B</name>
          <displayName>GROUP8_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_AMR0_P</name>
          <displayName>GROUP8_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP8_AMR_B</alternateRegister>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
