ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
        <register>
          <name>GROUP8_AMR1_P</name>
          <displayName>GROUP8_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_AMR2_P</name>
          <displayName>GROUP8_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP8_AMR3_P</name>
          <displayName>GROUP8_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_ACR_B</name>
          <displayName>GROUP9_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_ACR0_P</name>
          <displayName>GROUP9_ACR0_P</displayName>
          <description>Peli Acceptance Code register0</description>
          <alternateRegister>GROUP9_ACR_B</alternateRegister>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_ACR1_P</name>
          <displayName>GROUP9_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_ACR2_P</name>
          <displayName>GROUP9_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_ACR3_P</name>
          <displayName>GROUP9_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_AMR_B</name>
          <displayName>GROUP9_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_AMR0_P</name>
          <displayName>GROUP9_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP9_AMR_B</alternateRegister>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_AMR1_P</name>
          <displayName>GROUP9_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_AMR2_P</name>
          <displayName>GROUP9_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP9_AMR3_P</name>
          <displayName>GROUP9_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_ACR_B</name>
          <displayName>GROUP10_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_ACR0_P</name>
          <displayName>GROUP10_ACR0_P</displayName>
          <description>Peli Acceptance Code register</description>
          <alternateRegister>GROUP10_ACR_B</alternateRegister>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_ACR1_P</name>
          <displayName>GROUP10_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_ACR2_P</name>
          <displayName>GROUP10_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_ACR3_P</name>
          <displayName>GROUP10_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_AMR_B</name>
          <displayName>GROUP10_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_AMR0_P</name>
          <displayName>GROUP10_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP10_AMR_B</alternateRegister>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_AMR1_P</name>
          <displayName>GROUP10_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_AMR2_P</name>
          <displayName>GROUP10_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP10_AMR3_P</name>
          <displayName>GROUP10_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_ACR_B</name>
          <displayName>GROUP11_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_ACR0_P</name>
          <displayName>GROUP11_ACR0_P</displayName>
          <description>Peli Acceptance Code register0</description>
          <alternateRegister>GROUP11_ACR_B</alternateRegister>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_ACR1_P</name>
          <displayName>GROUP11_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_ACR2_P</name>
          <displayName>GROUP11_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_ACR3_P</name>
          <displayName>GROUP11_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_AMR_B</name>
          <displayName>GROUP11_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_AMR0_P</name>
          <displayName>GROUP11_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP11_AMR_B</alternateRegister>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_AMR1_P</name>
          <displayName>GROUP11_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_AMR2_P</name>
          <displayName>GROUP11_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP11_AMR3_P</name>
          <displayName>GROUP11_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP12_ACR_B</name>
          <displayName>GROUP12_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP12_ACR0_P</name>
          <displayName>GROUP12_ACR0_P</displayName>
          <description>Peli Acceptance Code register</description>
          <alternateRegister>GROUP12_ACR_B</alternateRegister>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP12_ACR1_P</name>
          <displayName>GROUP12_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP12_ACR2_P</name>
          <displayName>GROUP12_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP12_ACR3_P</name>
          <displayName>GROUP12_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP12_AMR_B</name>
          <displayName>GROUP12_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
