ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
        <register>
          <name>ACTIV</name>
          <displayName>ACTIV</displayName>
          <description>Clear ACTIVITY Interrupt Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <readAction>clear</readAction>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>ACTIV</name>
              <description>Reading this register clears the ACTIVITY interrupt if the I2C is not active anymore</description>
            </field>
          </fields>
        </register>
        <register>
          <name>STOP</name>
          <displayName>STOP</displayName>
          <description>Clear STOP_DET Interrupt Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <readAction>clear</readAction>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>STOP</name>
              <description>Read this register to clear the STOP_DET interrupt(bit 9)of the RAWISR register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <displayName>START</displayName>
          <description>Clear START_DET Interrupt Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <readAction>clear</readAction>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>START</name>
              <description>Read this register to clear the START_DET interrupt(bit 10)of the RAWISR register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GC</name>
          <displayName>GC</displayName>
          <description>Clear GEN_CALL Interrupt Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <readAction>clear</readAction>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>GC</name>
              <description>Read this register to clear the GEN_CALL interrupt(bit 11)of the RAWISR register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ENR</name>
          <displayName>ENR</displayName>
          <description>Enable Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>ABORT</name>
              <description>I2C transfer abort</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>I2C mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0006</resetValue>
          <fields>
            <field>
              <name>SLV_ACTIV</name>
              <description>Slave FSM activity status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MST_ACTIV</name>
              <description>Master FSM activity status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFF</name>
              <description>Receive FIFO completely full</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFNE</name>
              <description>Receive FIFO not empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit FIFO completely empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFNF</name>
              <description>Transmit FIFO not full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTIV</name>
              <description>I2C activity status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFLR</name>
          <displayName>TXFLR</displayName>
          <description>Transmit FIFO Level Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <name>CNT</name>
              <description>Transmit FIFO level.Contains the number of valid data entires in the transmit FIFO</description>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFLR</name>
          <displayName>RXFLR</displayName>
          <description>Receive FIFO Level Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <name>CNT</name>
              <description>Receive FIFO level. Contains the number of valid data entires in the receive FIFO</description>
            </field>
          </fields>
        </register>
        <register>
          <name>HOLD</name>
          <displayName>HOLD</displayName>
          <description>SDA Hold Time Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <fields>
            <field>
              <name>RX_HOLD</name>
              <description>Sets the required SDA hold time in units of ic_clk period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TX_HOLD</name>
              <description>Sets the required SDA hold time in units of ic_clk period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA</name>
          <displayName>DMA</displayName>
          <description>DMA Control Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TXEN</name>
              <description>Transmit DMA enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXEN</name>
              <description>Receive DMA enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP</name>
          <displayName>SETUP</displayName>
          <description>SDA Setup Time Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0064</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>CNT</name>
              <description>SDA setup</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GCR</name>
          <displayName>GCR</displayName>
          <description>ACK General Call Register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>GC</name>
              <description>ACK general call</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SLVMASK</name>
          <displayName>SLVMASK</displayName>
          <description>Slave Address Mask Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x03FF</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <name>Mask</name>
              <description>Slave Address Mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SLVRCVADDR</name>
          <displayName>SLVRCVADDR</displayName>
          <description>Receiver Address Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <name>ADDR</name>
              <description>Slave Address</description>
            </field>
          </fields>
        </register>
