ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OTG_FS</name>
      <description>USB On-The-Go Full-Speed</description>
      <groupName>OTG_FS</groupName>
      <baseAddress>0x50000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OTG_ISTAT</name>
          <displayName>OTG_ISTAT</displayName>
          <description>OTG Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <resetValue>0xE8</resetValue>
          <fields>
            <field>
              <name>ID_CHG</name>
              <description>When the USB ID pin signal is detected to be changed, the position bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>_1MSEC</name>
              <description>This bit is set when the 1 ms timer expires.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINE_STATE_CHG</name>
              <description>The interrupt can be used to detect reset and recover.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SESS_VLD_CHG</name>
              <description>When a VBUS change is detected, the position bit indicates that the session is valid or the session is no longer valid.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B_SESS_END_CHG</name>
              <description>This position bit when a VBUS change is detected on the B device.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A_VBUS_VLD_CHG</name>
              <description>This position is 1 when a VBUS change is detected on the A device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_ICTRL</name>
          <displayName>OTG_ICTRL</displayName>
          <description>OTG Interrupt Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>ID_EN</name>
              <description>Enable ID signal interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>_1MSEC_EN</name>
              <description>Enable 1 ms timer interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINE_STATE_EN</name>
              <description>Enable line state change interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SESS_VLD_EN</name>
              <description>Enables the session to be effectively interrupted</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B_SESS_END_EN</name>
              <description>Enable b device VBUS valid interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A_VBUS_VLD_EN</name>
              <description>Enable a device VBUS valid interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_STAT</name>
          <displayName>OTG_STAT</displayName>
          <description>OTG Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xA8</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Indicates the current status of the ID pin on the USB connector</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>_1MSEC</name>
              <description>This bit is reserved for the 1 ms counter and is not valid for software</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINE_STATE_STABLE</name>
              <description>Dithering</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SESS_VLD</name>
              <description>This bit is set when the VBUS voltage is higher than the valid threshold of the B device session bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B_SESS_END</name>
              <description>This bit is set when the VBUS voltage is below the B device session end threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A_VBUS_VLD</name>
              <description>When the VBUS voltage is higher than the VBUS effective threshold of a device, this bit will be set bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTG_CTRL</name>
          <displayName>OTG_CTRL</displayName>
          <description>OTG Control register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DP_HIGH</name>
              <description>When set, a pull_up resistor is enabled on the d_plus_data line</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DM_HIGH</name>
              <description>When set, a pull_up resistor is enabled on the d_reduce_data line</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DP_LOW</name>
              <description>When set, a pull_down resistor is enabled on the d_plus_data line</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DM_LOW</name>
              <description>When set, a pull_down resistor is enabled on the d_reduce_data line</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBUS_ON</name>
              <description>When set, the VBUS power signal will be turned on</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTG_EN</name>
              <description>When set, the pull_up and pull_down controls in this register can be used</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBUS_CHG</name>
              <description>When set, this will release the VBUS signal through the resistance. When set, it will send the VBUS signal through the resistance</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBUS_DSCHG</name>
              <description>When set, this releases the VBUS signal through the resistance</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STAT</name>
          <displayName>INT_STAT</displayName>
          <description>Interrupt status register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>STALL</name>
              <description>Stall interrupt is used in slave mode and master mode. In slave mode,SIE set when sending stall handshake packet.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATTACH</name>
              <description>If OTG_FS detects a connection to a USB peripheral, the location bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESUME</name>
              <description>When the K state is observed on the  DP_DM signal line within 2.5 microseconds, this position 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLEEP</name>
              <description>If otg_fs detects 3MS idle on the USB bus signal, then Position 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOK_DNE</name>
              <description>This bit is set when the token being processed completes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF_TOK</name>
              <description>If the otg_fs receives a sof token, this location bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERROR</name>
              <description>This position bit when any error condition in the ERR_STAT register occurs</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB_RST</name>
              <description>When otg_fs decodes valid USB reset, this position bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENB</name>
          <displayName>INT_ENB</displayName>
          <description>Interrupt enable register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>STALL_EN</name>
              <description>This position bit will enable STALL interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATTACH_EN</name>
              <description>This position bit will enable ATTACH interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESUME_EN</name>
              <description>This position bit will enable RESUME interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLEEP_EN</name>
              <description>This position bit will enable SLEEP interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOK_DNE_EN</name>
              <description>This position bit will enable SOF_ Tok interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF_TOK_EN</name>
              <description>This position bit will enable TOK_END interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERROR_EN</name>
              <description>Setting this bit enables the ERROR interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB_RST_EN</name>
              <description>Setting this bit will enable USB_ RST interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_STAT</name>
          <displayName>ERR_STAT</displayName>
          <description>Error interrupt status register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>BTS_ERR</name>
              <description>Bit stuff is set when the error is detected. The corresponding packet will be rejected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_ERR</name>
              <description>If DMA error,this position 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTO_ERR</name>
              <description>If a bus turnaround timeout error occurs, the location bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFN8</name>
              <description>The received data field is not 8 bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC16</name>
              <description>CRC16 failed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC5_EOF</name>
              <description>This error interrupt has two functions</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID_ERR</name>
              <description>PID check field failed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_ENB</name>
          <displayName>ERR_ENB</displayName>
          <description>Error interrupt enable register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>BTS_ERR_EN</name>
              <description>Setting this bit enables BTS_ERR interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_ERR_EN</name>
              <description>Setting this bit enables DMA_ERR interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BTO_ERR_EN</name>
              <description>Setting this bit enables BTO_ERR interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFN8_EN</name>
              <description>Setting this bit enables DFN8 interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC16_EN</name>
              <description>Setting this bit enables CRC16 interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC5_EOF_EN</name>
              <description>Setting this bit enables CRC5orEOF interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID_ERR_EN</name>
              <description>Setting this bit enables PID_ Err interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Status register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>ENDP</name>
              <description>These four bits encode the address of the endpoint that received or sent the previous token.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TX</name>
              <description>This bit indicates that the last updated BDT was used for transmit transmission OR receive data transmission</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ODD</name>
              <description>This bit indicates that the last buffer descriptor updated is in the odd set of BDT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <name>JSTATE</name>
              <description>USB differential receiver receives jstate signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SE0</name>
              <description>SE0 signal received by USB differential receiver</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXDSUSPEND_TOKENBUSY</name>
              <description>When otg_fs is in slave mode,it is TXD_ Suspend token when otg_fs is in host mode_ Busy</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESET</name>
              <description>Setting this bit will cause otg_fs to generate USB reset signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HOST_MODE_EN</name>
              <description>Setting this bit causes the otg_fs to work in host mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESUME</name>
              <description>Setting this bit will allow the otg_fs to perform the recovery signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ODD_RST</name>
              <description>Setting this bit will reset all BDT odd Ping_Pong bits to 0 and then specify an even number of BDT libraries</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB_EN_SOF_EN</name>
              <description>Setting this bit will make otg_fs work, clearing it will disable otg_fs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <displayName>ADDR</displayName>
          <description>Address register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LS_EN</name>
              <description>Enabling this bit tells otg_fs that the next token command to write to the token register must be executed at a low speed.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDR</name>
              <description>The USB address of the host is defined in the usb_7 mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDT_PAGE_01</name>
          <displayName>BDT_PAGE_01</displayName>
          <description>BDT page register 1</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <name>BDT_BA</name>
              <description>The 7_bit value provides address bits 15 to 9 of the BDT base address,which defines the location of the buffer descriptor table in the system memory</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FRM_NUML</name>
          <displayName>FRM_NUML</displayName>
          <description>Frame number register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>FRM_7_0</name>
              <description>These bits represent the lower 8 bits of 11 bit frames</description>
            </field>
          </fields>
        </register>
