ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
        <register>
          <name>SYSCFG</name>
          <displayName>SYSCFG</displayName>
          <description>System Configuration Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000101</resetValue>
          <fields>
            <field>
              <name>OSC_LPF_EN</name>
              <description>External crystal low-pass filter enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAD_OSC_TRIM</name>
              <description>Calibration of external crystal oscillator</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SFT_NRST_RMP</name>
              <description>Software mapping NRST</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECTOR_1K_CFG</name>
              <description>The size of flash page erase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROG_CHECK_EN</name>
              <description>Whether to check if the data in Flash is 0xFF when writing Flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>Configure Register 2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00031F00</resetValue>
          <fields>
            <field>
              <name>APB1_CLK_HV_PRE</name>
              <description>FSMC_PRE clock Frequency division coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FSMC_PRE</name>
              <description>*D8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TIMADV_PRE</name>
              <description>SYSCLK clock Frequency division coefficient</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TIMADV_CLKSEL</name>
              <description>TIMADV clock selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <displayName>ICSCR</displayName>
          <description>Internal clock sourcec Configure Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000000</resetValue>
          <fields>
            <field>
              <name>HSI_CAL_SFT</name>
              <description>Internal high-speed clock calibration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>HSI_CAL_SEL</name>
              <description>Initial value of internal high-speed clock calibration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TIME_CRS_SEL</name>
              <description>CRS module flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>PLL Configure Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0018031C</resetValue>
          <fields>
            <field>
              <name>PLLMUL</name>
              <description>PLL multiplication factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PLLDIV</name>
              <description>PLL divide factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PLL_LDS</name>
              <description>PLL lock detector accuracy select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL_ICTRL</name>
              <description>PLL CP current control signals</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLLXTPRE</name>
              <description>HSE divider for PLL entry</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLSRC</name>
              <description>PLL entry clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSIDLY</name>
          <displayName>HSIDLY</displayName>
          <description>HSI Delay Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000001E</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>HSI_EQU_CNT</name>
              <description>*D0</description>
            </field>
          </fields>
        </register>
        <register>
          <name>HSEDLY</name>
          <displayName>HSEDLY</displayName>
          <description>HSE Delay Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000BB80</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>HSE_EQU_CNT</name>
              <description>*D0</description>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLDLY</name>
          <displayName>PLLDLY</displayName>
          <description>PLL Delay Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000003EB</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>PLL_EQU_CNT</name>
              <description>*D0</description>
            </field>
          </fields>
        </register>
