ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
      </registers>
      <interrupt>
        <name>RCC_CRS</name>
        <description>RCC and CRS Interrupts</description>
        <value>5</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>Real time clock</description>
      <groupName>RTC</groupName>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>configuration register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OWIE</name>
              <description>Overflow interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALRIE</name>
              <description>Alarm interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECIE</name>
              <description>HSI delay time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>CSR</description>
          <addressOffset>0x04</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0020</resetValue>
          <fields>
            <field>
              <name>ALPEN</name>
              <description>RTC alarm loop enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
            </field>
            <field>
              <name>RTOFF</name>
              <description>RTC operation OFF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
            </field>
            <field>
              <name>CNF</name>
              <description>Configuration flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
            </field>
            <field>
              <name>RSF</name>
              <description>Registers synchronized flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>OWF</name>
              <description>Overflow flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ALRF</name>
              <description>Alarm flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SECF</name>
              <description>Second flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLH</name>
          <displayName>PRLH</displayName>
          <description>Prescaler load high register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x10</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <name>RTC_PRL</name>
              <description>RTC prescaler reload value high</description>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLL</name>
          <displayName>PRLL</displayName>
          <description>Prescaler load low register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x10</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>RTC_PRL</name>
              <description>RTC prescaler reload value low</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVH</name>
          <displayName>DIVH</displayName>
          <description>Prescaler divider factor high register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <name>RTC_DIV</name>
              <description>RTC clock divider high</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVL</name>
          <displayName>DIVL</displayName>
          <description>Prescaler divider factor low register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>RTC_DIV</name>
              <description>RTC clock divider low</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTH</name>
          <displayName>CNTH</displayName>
          <description>Counter high register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>RTC_CNT</name>
              <description>RTC counter high</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTL</name>
          <displayName>CNTL</displayName>
          <description>Counter low register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>RTC_CNT</name>
              <description>RTC counter low</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRH</name>
          <displayName>ALRH</displayName>
          <description>Alarm high register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>RTC_ALR</name>
              <description>RTC alarm high</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRL</name>
          <displayName>ALRL</displayName>
          <description>Alarm low register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>RTC_ALR</name>
              <description>RTC alarm low</description>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_MSRH</name>
          <displayName>RTC_MSRH</displayName>
          <description>RTC millisecond alarm high register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <name>MSR</name>
              <description>RTC msec high</description>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_MSRL</name>
          <displayName>RTC_MSRL</displayName>
          <description>RTC millisecond alarm low register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>MSR</name>
              <description>RTC msec low</description>
            </field>
          </fields>
        </register>
