ErBWs/My-TiCup-202210-B-MM32/.pack/MindMotion/MM32F3270_DFP.1.0.5/SVD/MM32F3270.svd
      </registers>
      <interrupt>
        <name>RTC</name>
        <description>RTC global interrupt</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>RTCAlarm</name>
        <description>RTC Alarms through EXTI line interrupt</description>
        <value>41</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SDIO</name>
      <description>SDIO</description>
      <groupName>SDIO</groupName>
      <baseAddress>0x40018000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0045</resetValue>
          <fields>
            <field>
              <name>RDWTEN</name>
              <description>SDIO read wait enable signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTEN</name>
              <description>SDIO interrupt enable signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>SDIO mode enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATWT</name>
              <description>Define the bus width of SD/MMC/SDIO port DAT line</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTSMSEL</name>
              <description>SD/MMC/SDIO port transfer speed mode selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>SD/MMC/SDIO port CLK line speed selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OUTM</name>
              <description>SD/MMC/SDIO port CMD line output drive mode selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMSEL</name>
              <description>Signal mode selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPMSEL</name>
              <description>SD/MMC/SDIO port operation mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>CR2</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CMDAF</name>
              <description>SDIO cmd12/IO Abort flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDCH</name>
              <description>SDIO command character</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOCLKGEN</name>
              <description>Enable auto gnerate 8 null clock after response/command or single block data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRESPEN</name>
              <description>Enable auto receive response after command</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCLKG</name>
              <description>SD/MMC/SDIO port CLK line 8 null clocks generation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CID_CSDRD</name>
              <description>CID/CSD read control bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPT</name>
              <description>Response/Command selection when bit[5] is 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOTREN</name>
              <description>Set auto 8 null/command/response transfer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRDIR</name>
              <description>Set data transfer direction</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTODATTR</name>
              <description>Set auto data transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BYTECNTR</name>
          <displayName>BYTECNTR</displayName>
          <description>Data transfer byte count register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0200</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CNT</name>
              <description>Data transfer byte counter</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TCBLKCNTR</name>
          <displayName>TCBLKCNTR</displayName>
          <description>Data block count register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CNT</name>
              <description>When multiple block transfer, transfer block count that are finished</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCR</name>
          <displayName>CRCCR</displayName>
          <description>CRC control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CMD_CRCEN</name>
              <description>SD/MMC/SDIO  port  CMD  Line  CRC  circuit enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAT_CRCEN</name>
              <description>SD/MMC/SDIO  port  DAT  Line  CRC  circuit enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHKEN</name>
              <description>Enable auto check crc_status[2:0]</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDMBEN</name>
              <description>Enable read multiple block data before response</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAT_CRCS</name>
              <description>DAT CRC selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CMD_CRCE</name>
              <description>CMD CRC Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAT_CRCE</name>
              <description>DAT CRC Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_CRC</name>
          <displayName>CMD_CRC</displayName>
          <description>CMD_CRC register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <name>VAL</name>
              <description>CMD CRC register value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DAT_CRCL</name>
          <displayName>DAT_CRCL</displayName>
          <description>CRC low data register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>VAL</name>
              <description>The DAT CRC low register value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DAT_CRCH</name>
          <displayName>DAT_CRCH</displayName>
          <description>CRC high data register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>VAL</name>
              <description>The DAT CRC high register value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>PORT</name>
          <displayName>PORT</displayName>
          <description>MMC port register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>PCLKS</name>
              <description>SD/MMC/SDIO port CLK line signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCMDS</name>
              <description>SD/MMC/SDIO port CMD line signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDATS</name>
              <description>SD/MMC/SDIO port DAT line signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTONTEN</name>
              <description>Auto Ncr Timer out enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NTCR</name>
              <description>Ncr Timeout count register(SD/MMC/SDIO clock number)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <displayName>IMR</displayName>
          <description>Interrupt mask register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D1L</name>
              <description>SDIO data1 line interrupt mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCE</name>
              <description>CRC status token err interrupt mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRNT</name>
              <description>Cmd and Resp Ncr Timeout interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBT</name>
              <description>Multi Block Timeout interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBD</name>
              <description>Multi Block done interrupt mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDE</name>
              <description>CMD CRC error interrupt mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATE</name>
              <description>DAT CRC error interrupt mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATD</name>
              <description>CMD done interrupt mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDD</name>
              <description>CMD done interrupt mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Interrupt clear mask register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>D1</name>
              <description>SDIO data1 line interrupt flag/clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCE</name>
              <description>CRC status error flag interrupt mask bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRNT</name>
              <description>Command and response Ncr timeout interrupt mask bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBT</name>
              <description>Multi-block transmission timeout interrupt mask bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBD</name>
              <description>Multi-block transfer complete interrupt mask bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDE</name>
              <description>CMD CRC error interrupt mask bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATE</name>
              <description>DAT CRC error interrupt mask bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATD</name>
              <description>DAT complete interrupt mask bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDD</name>
              <description>CMD complete interrupt mask bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CARDSEL</name>
          <displayName>CARDSEL</displayName>
          <description>card sell</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>CTREN</name>
              <description>SD/MMC/SDIO controller enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCLKEN</name>
              <description>SD/MMC/SDIO Time scale base(1Mhz) coefficient</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSCALE</name>
              <description>SD/MMC/SDIO Time scale base(1Mhz) coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGR</name>
          <displayName>SIGR</displayName>
          <description>Signal register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00FF</resetValue>
          <fields>
            <field>
              <name>PCMDS</name>
              <description>SD/MMC/SDIO port CMD Line signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCST</name>
              <description>CRC status[2:0] when write data CRC status token</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PDAT3S</name>
              <description>SD/MMC/SDIO port DAT3 Line signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDAT2S</name>
              <description>SD/MMC/SDIO port DAT2 Line signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDAT1S</name>
              <description>SD/MMC/SDIO port DAT1 Line signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDAT0S</name>
              <description>SD/MMC/SDIO port DAT0 Line signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MBCR</name>
          <displayName>MBCR</displayName>
          <description>Multi-block data transmission register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>NTSSEL</name>
              <description>SD/MMC/SDIO NAC timeout scale selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BTSSEL</name>
              <description>SD/MMC/SDIO Busy timeout scale selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCLKP</name>
              <description>SD/MMC/SDIO port CLK line polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAUTOTR</name>
              <description>Set SD/MMC/SDIO port full auto cmd and multiple block data transferring</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBDDIR</name>
              <description>Select multiple block data transfer direction</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMBDTREN</name>
              <description>Set SD/MMC/SDIO port auto multiple block data transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BLKCNTR</name>
          <displayName>BLKCNTR</displayName>
          <description>Data block count register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CNT</name>
              <description>Data block number</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCNTR</name>
          <displayName>TOCNTR</displayName>
          <description>Data transfer timeout count register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>CNT</name>
              <description>Data transfer timeout count</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF0</name>
          <displayName>CMD_BUF0</displayName>
          <description>CMD buffer register 0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 0, mapped to command bit 15 to bit 8 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF1</name>
          <displayName>CMD_BUF1</displayName>
          <description>CMD buffer register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 1, mapped to command bit 23 to bit 16 bits</description>
            </field>
          </fields>
        </register>
